{"pages":[],"posts":[{"title":"About Me","text":"I’m a PhD student in Computer Science at Case Western Reserve University. My research primarily focuses on the software engineering, machine learning, system and blockchain security. Working Experience Software Engineer Intern, Google, 05/2022 - 08/2022 Research Intern, Palo Alto Networks, 05/2019 - 08/2019 Yelp Software Engineering Intern, 05/2018 - 08/2018 Pulications Zhiqiang Xu, Pengcheng Fang, Changlin Liu, Xusheng Xiao, Yu Wen, and Dan MengGraph Summarization on System Audit Logs for Attack InvestigationIn Proceedings of the IEEE Symposium on Security and Privacy，San Francisco, CA, USA, May 2022. Pengcheng Fang*, Peng Gao*, Changlin Liu, Erman Ayday, Kangkook Jee, Ting Wang, Yanfang (Fanny) Ye, Zhuotao Liu, and Xusheng XiaoBack-Propagating System Dependency Impact for Attack InvestigationIn Proceedings of the USENIX Security Symposium (USENIX Security 2022), Boston, MA, USA, Aug 2022. Pengcheng Fang, Zhenhua Zou, Xusheng Xiao, and Zhuotao LiuiSyn: Semi-automated Smart Contract Synthesis from Legal Financial Agreements（ISSTA 2023）Seattle, WA, USA, July 2023 ContractFix: A Framework for Automatically Fixing Vulnerabilities in Smart Contracts [Under revision]","link":"/2021/07/25/me/"},{"title":"","text":"Enable Slurmdbd for SlurmIn recent days, we enable the slurmdbd for slurm running in our cluster. This post records some issues that I solved in this process.Hope it will help other people having the same requirements and issues. First, I will list the most useful link for this task.https://slurm.schedmd.com/accounting.htmlSuprisingly, this link does any keyword associated with slurmdbd. Thus, it will not appear in your search results.However, it contains most information you should know. These information includes how to modify slurm.conf, setting database, and create slurmdbd.conf. Second, I will describe the issues that I have and how to solve them. If you have the similar issues, then you are lucky. Port issues: The default port of slurmdbd is 6819. Mysql’s default port is 3306. You should make sure these two port of the machine who running slurmdbd is OK for connection. You may want to check your firewall rules. However, if there are no rules banned the connection to these two ports, it does not mean these two ports are open for connection. Thus, I will suggest to use telnet hostname 6819(3306) to test the connection of the port.","link":"/2023/07/18/slurmdbd/"}],"tags":[],"categories":[]}